{
  "backend/main.mo": "Motoko canister implementing user profiles, tournaments, wallet balances, and authorization checks with persistent maps and query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and requirements with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including pages, components, hooks, and styling.",
  "frontend/index.css": "Tailwind base styles defining a custom OKLCH color theme with light and dark mode variables.",
  "frontend/index.html": "Minimal HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, handles authentication state, and displays the main layout with conditional profile setup modal.",
  "frontend/src/components/auth/AuthStatus.tsx": "Sign-in/sign-out button handling Internet Identity authentication with error recovery and query cache clearing.",
  "frontend/src/components/auth/PrincipalBadge.tsx": "Shows the user’s principal in shortened form with a copy-to-clipboard button.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter display name and Free Fire UID, saving via profile mutation.",
  "frontend/src/components/common/ErrorNotice.tsx": "Displays backend errors with user-friendly replacements for common tournament and profile issues.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main layout with navigation, user info, and responsive header, using queries for profile and balance.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and exposing identity status.",
  "frontend/src/hooks/useQueries.ts": "Wraps common backend queries and mutations for user profile, wallet balance, tournaments, and joining actions.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client, and Internet Identity provider.",
  "frontend/src/pages/LandingPage.tsx": "Landing page prompting login and showcasing feature cards with a styled hero section.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile form allowing display name and Free Fire UID updates with loading, error, and success states.",
  "frontend/src/pages/TournamentDetailsPage.tsx": "Displays detailed tournament info and handles joining logic, including eligibility checks, balance validation, and error handling.",
  "frontend/src/pages/TournamentsPage.tsx": "Lists active tournaments with status, entry fee, and basic info, including loading skeletons and navigation links.",
  "frontend/src/pages/WalletPage.tsx": "Shows the user's wallet balance, a demo top‑up section, and placeholder transaction history, requiring sign‑in to view.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and layout settings for the frontend.",
  "project_state.json": "Defines overall project state including versioning, image requirements, implemented features, and pending feature requests for a Free Fire tournament app. Serves as the central configuration and progress record for the build."
}